ams/src/Catalogs/AMS_ПравилаПродаж/AMS_ПравилаПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_ПравилаПродаж</name>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчикаЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчикаЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Обрешетка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПередачиТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПравилаПродажи</name>
    <type>
      <types>EnumRef.AMS_СтатусыПравилПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВыбораТипаОснования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыВнеПрайса</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/InformationRegisters/_НоменклатураКлиентов/_НоменклатураКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_НоменклатураКлиентов</name>
  <resources>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <comment>Наименование в латинской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВТранскрипции</name>
    <comment>Наименование в русской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>550</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ЧЗ_МаслоСмазочное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMS_ЧЗ_БытоваяХимия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СокращенноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/AMS_ПравилаПродаж/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) Тогда
		Объект.Партнер = Объект.Владелец;
	КонецЕсли;
	
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Партнер,"Родитель");
	Родитель = ?(ЗначениеЗаполнено(Родитель),Родитель,Объект.Партнер);
	
	Объект.Дата = ТекущаяДатаСеанса(); // Этот реквизит нужен только для - ДоставкаТоваров.ПриЧтенииСозданииРаспоряженийНаСервере(Элементы, Объект) 
	
	ДоставкаТоваров.ПриЧтенииСозданииРаспоряженийНаСервере(Элементы, Объект);
	
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиС);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиПо);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиС1);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиПо1);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиС2);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиПо1);

	Если Объект.ФлагВыбораТипаОснования = 0 Тогда
		Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "Номер, Дата, НаименованиеДляПечати");
		
		Объект.ОснованиеНомер = Стр.Номер;
		Объект.ОснованиеДата  = Стр.Дата;
		Объект.Основание      = Стр.НаименованиеДляПечати;
	КонецЕсли;
	
	НастройкаФормы();
	ЗаполнитьТовары();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ДанныеКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект.Владелец, "_АртикулКлиента, _АртикулКлиентаПлюс");

	Если НЕ (ДанныеКлиента._АртикулКлиента ИЛИ ДанныеКлиента._АртикулКлиентаПлюс) Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений._НоменклатураКлиентов.СоздатьНаборЗаписей();
	Набор.Отбор.Партнер.Установить(Родитель);
	Набор.Прочитать();
	Набор.Очистить();
	
 	ОтборТовар   = Новый Структура();
	Для Каждого Стр Из Товары Цикл
		НомерСтроки  = Товары.Индекс(Стр) + 1;
		
		Номенклатура = Стр.Номенклатура;
		Артикул      = Стр.Артикул;
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			ТекстОшибки = НСтр("ru='Не заполнено поле ""Номенклатура"" в строке %НомерСтроки% списка ""Товары клиента""'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
		КонецЕсли;
			
		Если ПустаяСтрока(Артикул) Тогда
			ТекстОшибки = НСтр("ru='Не заполнено поле ""Артикул клиента"" в строке %НомерСтроки% списка ""Товары клиента""'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ОтборТовар.Очистить();
		ОтборТовар.Вставить("Номенклатура",Номенклатура);
		
		Строки = Товары.НайтиСтроки(ОтборТовар);
		Если Строки.Количество() > 1 Тогда
			Для каждого ТекСтр Из Строки Цикл
				Если Строки.Найти(ТекСтр) > 0 Тогда
					ТекстОшибки = НСтр("ru='В списке ""Товары клиента"" %Номенклатура% повторяется в строках %НомерСтроки% и %НомерСтроки2%'");
					ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%Номенклатура%", Номенклатура);
					ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки);
					ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки2%", Товары.Индекс(ТекСтр) + 1);
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Запись = Набор.Добавить();
		Запись.Партнер         = Родитель;
		Запись.Номенклатура    = Номенклатура;
		Запись.ПорядковыйНомер = НомерСтроки;
		Запись.Артикул         = Артикул;
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		Попытка
			Набор.Записать();
		Исключение
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//	Если Объект.СтатусПравилаПродажи = Перечисления.AMS_СтатусыПравилПродаж.Действует И Объект.Основное Тогда
//		Запрос = Новый Запрос();
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	т.Ссылка КАК ПравилоПродаж
//		|ИЗ
//		|	Справочник.AMS_ПравилаПродаж КАК т
//		|ГДЕ
//		|	т.Владелец = &Владелец
//		|	И НЕ т.Ссылка = &Ссылка";
//		Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
//		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
//
//		Рез = Запрос.Выполнить();
//		Выб = Рез.Выбрать();
//		Пока Выб.Следующий() Цикл
//			ТекОбъект = Выб.ПравилоПродаж.ПолучитьОбъект();
//			ТекОбъект.Основное = Ложь;
//			ТекОбъект.Записать();
//		КонецЦикла;
//	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ПравилаПродаж", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ДоговорКонтрагента" И Источник = Объект.Договор Тогда 
		НастройкаФормы();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область СтраницаОсновное

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриИзмененииОрганизации(Объект.Организация);
	НастройкаФормы();
	Объект.Наименование = AMS_ВызовСервера.ПолучитьНаименованиеПравила(Объект);
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)
	ПриИзмененииСоглашения(Объект.Соглашение);
	НастройкаФормы();
	Объект.Наименование = AMS_ВызовСервера.ПолучитьНаименованиеПравила(Объект);
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
	
	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
	ПараметрыВыбораСоглашения.Партнер                     = Объект.Партнер;
	ПараметрыВыбораСоглашения.Документ                    = Объект.Соглашение;
	ПараметрыВыбораСоглашения.ДатаДокумента               = ОбщегоНазначенияКлиент.ДатаСеанса();
	ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;
	
	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриИзмененииКонтрагента(Объект.Контрагент);
	НастройкаФормы();
	Объект.Наименование = AMS_ВызовСервера.ПолучитьНаименованиеПравила(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ПриИзмененииФлагВыбораТипаОснования();
	НастройкаФормы();
КонецПроцедуры

#КонецОбласти

#Область СтраницаДоставка

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	ЗаполнитьУстановитьРеквизитыДоставкиСервер(Элемент.Имя);	
//	AMS_УправлениеРеквизитамиДоставки();
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПартнерПриИзменении(Элемент)
	ЗаполнитьУстановитьРеквизитыДоставкиСервер(Элемент.Имя);	
КонецПроцедуры

#Область ОбработкаРеквизитовАдресДоставки

&НаКлиенте
Процедура АдресДоставкиСамовывозПриИзменении(Элемент)
	ОбработатьИзменениеАдреса(Элемент, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателяПриИзменении(Элемент)
	ОбработатьИзменениеАдреса(Элемент, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПеревозчикаПриИзменении(Элемент)
	ОбработатьИзменениеАдреса(Элемент, "АдресДоставкиПеревозчика");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя1ПриИзменении(Элемент)
	ОбработатьИзменениеАдреса(Элемент, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя2ПриИзменении(Элемент)
	ОбработатьИзменениеАдреса(Элемент, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя3ПриИзменении(Элемент)
	ОбработатьИзменениеАдреса(Элемент, "АдресДоставки");
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиСамовывозНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	АдресДоставкиНачалоВыбора(Элемент, СтандартнаяОбработка, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	АдресДоставкиНачалоВыбора(Элемент, СтандартнаяОбработка, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПеревозчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	АдресДоставкиНачалоВыбора(Элемент, СтандартнаяОбработка, "АдресДоставкиПеревозчика");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	АдресДоставкиНачалоВыбора(Элемент, СтандартнаяОбработка, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	АдресДоставкиНачалоВыбора(Элемент, СтандартнаяОбработка, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя3НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	АдресДоставкиНачалоВыбора(Элемент, СтандартнаяОбработка, "АдресДоставки");
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиСамовывозОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПеревозчикаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя1ОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя2ОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя3ОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиСамовывозОчистка(Элемент, СтандартнаяОбработка)
	АдресДоставкиОчистка(СтандартнаяОбработка, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателяОчистка(Элемент, СтандартнаяОбработка)
	АдресДоставкиОчистка(СтандартнаяОбработка, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПеревозчикаОчистка(Элемент, СтандартнаяОбработка)
	АдресДоставкиОчистка(СтандартнаяОбработка, "АдресДоставкиПеревозчика");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя1Очистка(Элемент, СтандартнаяОбработка)
	АдресДоставкиОчистка(СтандартнаяОбработка, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя2Очистка(Элемент, СтандартнаяОбработка)
	АдресДоставкиОчистка(СтандартнаяОбработка, "АдресДоставки");
КонецПроцедуры
&НаКлиенте
Процедура АдресДоставкиПолучателя3Очистка(Элемент, СтандартнаяОбработка)
	АдресДоставкиОчистка(СтандартнаяОбработка, "АдресДоставки");
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОсобыеУсловияПеревозкиПриИзменении(Элемент)
	ОсобыеУсловияПеревозкиПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОсобыеУсловияПеревозки1ПриИзменении(Элемент)
	ОсобыеУсловияПеревозкиПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОсобыеУсловияПеревозкиДоставкаПеревозчикомПриИзменении(Элемент)
	ОсобыеУсловияПеревозкиПриИзмененииСервер();
КонецПроцедуры

#КонецОбласти

#Область СтраницаРеквизитыПечати

&НаКлиенте
Процедура ФлагВыбораТипаОснованияПриИзменении(Элемент)
	ПриИзмененииФлагВыбораТипаОснования();
	НастройкаФормы();
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДополнитьИнформациюПоДоставкеКонтактами(Команда)
	
	ДополнитьИнформациюПоДоставкеКонтактамиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	ДанныеКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "_АртикулКлиента, _АртикулКлиентаПлюс");
	
	Элементы.СтраницаТоварыКлиента.Видимость = ДанныеКлиента._АртикулКлиента ИЛИ ДанныеКлиента._АртикулКлиентаПлюс;
	
	Если Объект.ФлагВыбораТипаОснования = 0 Тогда
		Элементы.Основание.Видимость      = Истина;
		Элементы.ОснованиеНомер.Видимость = Истина;
		Элементы.ОснованиеДата.Видимость  = Истина;
	
	ИначеЕсли Объект.ФлагВыбораТипаОснования = 1 Тогда
		Элементы.Основание.Видимость      = Истина;
		Элементы.ОснованиеНомер.Видимость = Ложь;
		Элементы.ОснованиеДата.Видимость  = Ложь;

	ИначеЕсли Объект.ФлагВыбораТипаОснования = 2 Тогда
		Элементы.Основание.Видимость      = Ложь;
		Элементы.ОснованиеНомер.Видимость = Ложь;
		Элементы.ОснованиеДата.Видимость  = Ложь;
	КонецЕсли;
	
	мКонтрагент = Объект.Контрагент;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСоглашения(Соглашение)
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ЗначениеЗаполнено(Соглашение) Тогда 
		
		ТекОбъект.Наименование = "" + ТекОбъект.Контрагент + " с " + ТекОбъект.Организация;
		
		СоглашениеКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Соглашение,"Контрагент");
		
		Если ЗначениеЗаполнено(СоглашениеКонтрагент) Тогда
			ТекОбъект.Контрагент = СоглашениеКонтрагент;
			
		Иначе
		    ТабКонтрагент = Справочники.AMS_ПравилаПродаж.ПолучитьКонтрагентов(ТекОбъект.Владелец);
			
			Если ТабКонтрагент.Количество() = 1 Тогда 
				ТекОбъект.Контрагент = ТабКонтрагент[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекОбъект.Организация) и ЗначениеЗаполнено(ТекОбъект.Контрагент) Тогда
			ТабДоговор = Справочники.AMS_ПравилаПродаж.ПолучитьДоговора(ТекОбъект.Организация,ТекОбъект.Владелец,ТекОбъект.Контрагент);
			
			Если ТабДоговор.Количество() = 1 Тогда 
				ТекОбъект.Договор = ТабДоговор[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		ТекОбъект.Организация = Справочники.Организации.ПустаяСсылка(); 
		ТекОбъект.Контрагент  = Справочники.Контрагенты.ПустаяСсылка();
		ТекОбъект.Договор     = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОрганизации(Организация)
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	ТекОбъект.Наименование = "" + ТекОбъект.Владелец + " с " + Организация;
		
	Если ЗначениеЗаполнено(Организация) Тогда
		СоглашениеКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекОбъект.Соглашение,"Контрагент");
		
		Если ЗначениеЗаполнено(СоглашениеКонтрагент) Тогда
			ТекОбъект.Контрагент = СоглашениеКонтрагент;
		Иначе
			ТабКонтрагент = Справочники.AMS_ПравилаПродаж.ПолучитьКонтрагентов(ТекОбъект.Владелец);
				
			Если ТабКонтрагент.Количество() = 1 Тогда 
				ТекОбъект.Контрагент = ТабКонтрагент[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекОбъект.Контрагент) Тогда
			ТабДоговор = Справочники.AMS_ПравилаПродаж.ПолучитьДоговора(Организация,ТекОбъект.Владелец,ТекОбъект.Контрагент);
			
			Если ТабДоговор.Количество() = 1 Тогда 
				ТекОбъект.Договор = ТабДоговор[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Если Организация = AMS_ВызовСервера.ОрганизацияКемикал() Тогда 
			ТекОбъект.Грузоотправитель = AMS_ВызовСервера.ПолучитьГрузоотправителяКемикал();
		Иначе
			ТекОбъект.Грузоотправитель = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
	
	Иначе
		ТекОбъект.Грузоотправитель = Справочники.Контрагенты.ПустаяСсылка();
		ТекОбъект.Контрагент      = Справочники.Контрагенты.ПустаяСсылка();
		ТекОбъект.Договор         = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКонтрагента(Контрагент)
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		КонтрагентПартнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент,"Партнер");
		
		Если НЕ (КонтрагентПартнер = Объект.Владелец или КонтрагентПартнер = Родитель) Тогда
			ТекстОшибки = НСтр("ru='Контрагент %Контрагент% является партнеров %Партнер%, а не %Владелец%.'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%Контрагент%", Контрагент);
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%Партнер%", КонтрагентПартнер);
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%Владелец%", Объект.Владелец);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,"Объект.Контрагент");
			Контрагент = мКонтрагент;
		КонецЕсли;
		
		ТабДоговор = Справочники.AMS_ПравилаПродаж.ПолучитьДоговора(ТекОбъект.Организация,ТекОбъект.Владелец,Контрагент);
		
		Если ТабДоговор.Количество() = 1 Тогда 
			ТекОбъект.Договор = ТабДоговор[0].Ссылка;
		КонецЕсли;
	Иначе
		ТекОбъект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииФлагВыбораТипаОснования()
	Если Объект.ФлагВыбораТипаОснования = 0 Тогда
		Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "Номер, Дата, НаименованиеДляПечати");
		
		Объект.ОснованиеНомер = Стр.Номер;
		Объект.ОснованиеДата  = Стр.Дата;
		Объект.Основание      = Стр.НаименованиеДляПечати;
	
	ИначеЕсли Объект.ФлагВыбораТипаОснования = 1 Тогда
		Объект.ОснованиеНомер = "";
		Объект.ОснованиеДата  = Дата(1, 1, 1);

	ИначеЕсли Объект.ФлагВыбораТипаОснования = 2 Тогда
		Объект.ОснованиеНомер = "";
		Объект.ОснованиеДата  = Дата(1, 1, 1);
		Объект.Основание      = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнитьИнформациюПоДоставкеКонтактамиСервер()
	
	ДоставкаТоваров.ДополнитьИнформациюПоДоставкеКонтактами(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары()
	ДанныеКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "_АртикулКлиента, _АртикулКлиентаПлюс, _ПорядокКлиента");

	Если НЕ (ДанныеКлиента._АртикулКлиента ИЛИ ДанныеКлиента._АртикулКлиентаПлюс) Тогда 
		Возврат;
	КонецЕсли;
	
	Если  ДанныеКлиента._ПорядокКлиента Тогда 
		Порядок = "ПорядковыйНомер";
	Иначе
		Порядок = "т.Номенклатура.Наименование";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Родитель);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.ПорядковыйНомер,
	|	т.Номенклатура,
	|	т.Артикул
	|ИЗ
	|	РегистрСведений._НоменклатураКлиентов КАК т
	|ГДЕ
	|	т.Партнер = &Партнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	" + Порядок;
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ОсобыеУсловияПеревозкиПриИзмененииСервер()
	ДоставкаТоваров.ОсобыеУсловияПеревозкиПриИзменении(Элементы, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеАдреса(Элемент, ИмяРеквизитаАдреса)
	ИменаРеквизитов = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки(ИмяРеквизитаАдреса);
	
	Если ПустаяСтрока(Объект[ИменаРеквизитов.ИмяРеквизитаАдресаДоставки]) Тогда
		
		ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
			Объект[ИменаРеквизитов.ИмяРеквизитаАдресаДоставки],
			Объект[ИменаРеквизитов.ИмяРеквизитаАдресаДоставкиЗначенияПолей],
			Объект[ИменаРеквизитов.ИмяРеквизитаАдресаДоставкиЗначение]);
		
	Иначе
		
		ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
			Элемент,
			Объект[ИменаРеквизитов.ИмяРеквизитаАдресаДоставки],
			Объект[ИменаРеквизитов.ИмяРеквизитаАдресаДоставкиЗначение]);
		
		АдресДоставкиПриИзмененииНаСервере(
			Объект[ИменаРеквизитов.ИмяРеквизитаАдресаДоставки],
			Объект[ИменаРеквизитов.ИмяРеквизитаАдресаДоставкиЗначение],
			Объект[ИменаРеквизитов.ИмяРеквизитаАдресаДоставкиЗначенияПолей]);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура АдресДоставкиПриИзмененииНаСервере(Адрес, АдресЗначение, АдресЗначенияПолей)
	АдресВСвободнойФорме = УправлениеКонтактнойИнформацией.АдресВведенВСвободнойФорме(АдресЗначение);
	Если НЕ АдресВСвободнойФорме Тогда
		
		ДанныеСтраны = УправлениеКонтактнойИнформацией.СтранаАдресаКонтактнойИнформации(АдресЗначение);
		
		НоваяСтруктураАдреса = УправлениеКонтактнойИнформацией.СведенияОбАдресе();
		НоваяСтруктураАдреса.Представление = Адрес;
		НоваяСтруктураАдреса.Страна = ДанныеСтраны.Наименование;
		НоваяСтруктураАдреса.КодСтраны = ДанныеСтраны.Код;
		
		АдресЗначение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(
			НоваяСтруктураАдреса,
			Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		УстановитьТипАдресаВСвободнойФорме(АдресЗначение);
		
	КонецЕсли;
	
	АдресЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(
		АдресЗначение,
		Адрес,
		Перечисления.ТипыКонтактнойИнформации.Адрес);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьТипАдресаВСвободнойФорме(АдресДоставкиЗначение)
	СтрокаЗаменяемыйТип = """addressType"": ""Административно-территориальный""";
	СтрокаСвободныйТип = """addressType"": ""ВСвободнойФорме""";
	АдресДоставкиЗначение = СтрЗаменить(АдресДоставкиЗначение, СтрокаЗаменяемыйТип, СтрокаСвободныйТип);
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, СтандартнаяОбработка, ИмяАдреса)
	ИменаРеквизитовАдресовДоставки = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки(ИмяАдреса);
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
		Элемент,
		Объект,
		ИменаРеквизитовАдресовДоставки,
		СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОчистка(СтандартнаяОбработка, ИмяАдреса)
	СтандартнаяОбработка = Ложь;
	
	ИменаРеквизитовАдресовДоставки = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки(ИмяАдреса);
	
	ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
		Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставки],
		Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначенияПолей],
		Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначение]);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУстановитьРеквизитыДоставкиСервер(ИмяЭлементаФормы);
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда 
		ПолучательОтправитель = Новый Структура("ИмяПоля,Значение","Партнер",Объект.Партнер);
	Иначе 		
		ВызватьИсключение НСтр("ru = 'Получатель (отправитель) не определен.'");
	КонецЕсли;
	
	РеквизитыДоставки = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(Объект);
	РеквизитыДоставки.Вставить(ПолучательОтправитель.ИмяПоля, ПолучательОтправитель.Значение);
	РеквизитыДоставки.Вставить("Ссылка");
	ЗаполнитьЗначенияСвойств(РеквизитыДоставки, Объект);
	РеквизитыДоставки.Вставить("ПолучательОтправитель", ПолучательОтправитель);
	
	Если ЗначениеЗаполнено(РеквизитыДоставки.Партнер) И НЕ ПустаяСтрока(РеквизитыДоставки.АдресДоставки) Тогда
		ДанныеАдреса = AMS_ВызовСервера.ПолучитьДанныеАдресаДоставки(РеквизитыДоставки.Партнер,РеквизитыДоставки.АдресДоставки);
		РеквизитыДоставки.ЗонаДоставки = ДанныеАдреса.ЗонаДоставки;
	КонецЕсли;
	
	СпособДоставки = Объект.СпособДоставки;
	Если СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика
		Или СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
		Или СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада
		Или СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи Тогда
			
		Если Элементы.Найти("ПеревозчикПартнер") <> Неопределено
			И Элементы.ПеревозчикПартнер.СписокВыбора.Количество() > 0
			И Объект.ПеревозчикПартнер = Справочники.Партнеры.ПустаяСсылка() Тогда
			Объект.ПеревозчикПартнер = Элементы.ПеревозчикПартнер.СписокВыбора[0].Значение;
		КонецЕсли;
		
	Иначе
		Объект.ПеревозчикПартнер = Справочники.Партнеры.ПустаяСсылка();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыДоставки);
	
	ДоставкаТоваровКлиентСервер.УстановитьСтраницуДоставки(Элементы,СпособДоставки,ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"));
	
	ОсобыеУсловияПеревозки = Объект.ОсобыеУсловияПеревозки;
	Элементы.ОсобыеУсловияПеревозкиОписание.Доступность                     = ОсобыеУсловияПеревозки;
	Элементы.ОсобыеУсловияПеревозкиОписание1.Доступность                    = ОсобыеУсловияПеревозки;
	Элементы.ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком.Доступность = ОсобыеУсловияПеревозки;

	ДоставкаТоваров.ПриЧтенииСозданииРаспоряженийНаСервере(Элементы, Объект);
КонецПроцедуры

#КонецОбласти
